# CurveArrArray Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
CurveArrArray Constructor
CurveArrArray Class See Also
---
Initializes a new instance of the CurveArrArray class
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public CurveArrArray()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
CurveArrArray()
```

# See Also
CurveArrArray Class
Autodesk.Revit.DB Namespace